#define _CRT_SECURE_NO_WARNINGS
#include <locale.h>
#include <stdio.h>
main()
{
	setlocale(LC_CTYPE, "RUS");
	int d, x,a,b;
	puts("Введите день и месяц рождения без пробелов");
	scanf("%d",&d);
	a = d / 100;
	b = d % 100;
	x = ((a >= 21 && a < 32 && b == 1) || (a <= 19 && a < 28 && b == 2)) ? 1 : 0;
	x += ((a >= 20 && a < 29 && b == 2) || (a <= 20 && a < 32 && b == 3)) ? 2 : 0;
	x += ((a >= 21 && a < 32 && b == 3) || (a <= 20 && a < 31 && b == 4)) ? 3 : 0;
	x += ((a >= 21 && a < 31 && b == 4) || (a <= 21 && a < 32 && b == 5)) ? 4 : 0;
	x += ((a >= 22 && a < 32 && b == 5) || (a <= 21 && a < 31 && b == 6)) ? 5 : 0;
	x += ((a >= 22 && a < 31 && b == 6) || (a <= 22 && a < 32 && b == 7)) ? 6 : 0;
	x += ((a >= 23 && a < 32 && b == 7) || (a <= 23 && a < 32 && b == 8)) ? 7 : 0;
	x += ((a >= 24 && a < 32 && b == 8) || (a <= 23 && a < 31 && b == 9)) ? 8 : 0;
	x += ((a >= 24 && a < 31 && b == 9) || (a <= 23 && a < 32 && b == 10)) ? 9 : 0;
	x += ((a >= 24 && a < 32 && b == 10) || (a <= 23 && a < 31 && b == 11)) ? 10 : 0;
	x += ((a >= 23 && a < 32 && b == 11) || (a <= 22 && a < 32 && b == 12)) ? 11 : 0;
	x += ((a >= 23 && a < 32 && b == 12) || (a <= 20 && a < 32 && b == 1)) ? 12 : 0;
	switch (x)
	{
	case(1):
		printf("Ваш знак Зодиака: Водолей\n");//Контрольный пример: 1002
		break;
	case(2):
		printf("Ваш знак Зодиака: Рыбы\n");//Контрольный пример: 2402
		break;
	case(3):
		printf("Ваш знак Зодиака: Овен\n");//Контрольный пример: 0104
		break;
	case(4):
		printf("Ваш знак Зодиака: Телец\n");//Контрольный пример: 0905
		break;
	case(5):
		printf("Ваш знак Зодиака: Близнецы\n");//Контрольный пример: 1906
		break;
	case(6):
		printf("Ваш знак Зодиака: Рак\n");//Контрольный пример: 2306
		break;
	case(7):
		printf("Ваш знак Зодиака: Лев\n");//Контрольный пример: 1108
		break;
	case(8):
		printf("Ваш знак Зодиака: Дева\n");//Контрольный пример: 2009
		break;
	case(9):
		printf("Ваш знак Зодиака: Весы\n");//Контрольный пример: 2210
		break;
	case(10):
		printf("Ваш знак Зодиака: Скорпион\n");//Контрольный пример: 1111
		break;
	case(11):
		printf("Ваш знак Зодиака: Стрелец\n");//Контрольный пример: 1212
		break;
	case(12):
		printf("Ваш знак Зодиака: Козерог\n");//Контрольный пример: 3112
		break;
	default:
		printf("Некоректная дата\n");//Контрольный пример: 1013
	}
}